# -*- default-directory: "/Users/william/.emacs.d"; -*-
#+TITLE: emacs.d.org
#+DATE: <2017-07-28 Fri>
#+AUTHOR: William Bert
#+EMAIL: william.bert@gmail.com
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline author:nil c:nil
#+OPTIONS: creator:comment d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t
#+OPTIONS: num:nil p:nil pri:nil stat:t tags:nil tasks:t tex:t timestamp:nil toc:nil
#+OPTIONS: todo:t |:t
#+STARTUP: overview
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export
* TODO PATH stuff
  - exec-path-from-shell creates a login shell at startup and reads PATH from
    it. Kind of a hack.
  - https://github.com/arouanet/path-helper is an alternative that uses macOS's
    own PATH infrastructure
    - /etc/paths is default
    - /etc/paths.d is for customization
    - path_helper is a macOS utility that reads these files
#+BEGIN_SRC sh
ls -l /etc/paths
cat /etc/paths
#+END_SRC

#+RESULTS:
| -rw-r--r--@ | 1 | root | wheel | 30 | Mar | 11 | 2017 | /etc/paths |
| /usr/bin    |   |      |       |    |     |    |      |            |
| /bin        |   |      |       |    |     |    |      |            |
| /usr/sbin   |   |      |       |    |     |    |      |            |
| /sbin       |   |      |       |    |     |    |      |            |

#+BEGIN_SRC sh
ls -l /etc/paths.d
#+END_SRC

#+RESULTS:
| total       | 24 |      |       |    |     |    |       |            |
| -rw-r--r--@ |  1 | root | wheel | 13 | Oct | 26 |  2016 | 40-XQuartz |
| -rw-r--r--@ |  1 | root | wheel | 23 | Jun |  4 | 03:13 | MacGPG2    |
| -rw-r--r--@ |  1 | root | wheel | 20 | Sep | 26 |  2017 | TeX        |
